{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "resume.pdf",
  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "With <span class='underline'>5 years of experience</span>, I specialize in crafting frontend systems, reusable components, and innovative technological solutions to enhance web accessibility. My focus is on writing clean, scalable, and maintainable code, primarily in <span class='underline'>Angular</span> and in general <span class='underline'>JavaScript</span>.",
  "Banner.ActionBtn": "Say Hi",
  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "With over <span class='underline'>5 years of professional experience</span>, I have embraced diverse roles such as <span class='underline'>Frontend Developer</span>, <span class='underline'>Tutor</span>, and <span class='underline'>Technical Lead</span>. My passion lies in crafting innovative solutions that drive impactful results.",
    "I specialize in enhancing systems, optimizing performance, standardizing development patterns, and bringing forward ideas that elevate the value of every project I contribute to.",
    "Beyond 9 to 5, I enjoy creating tools and applications for personal use, blending utility with creativity.",
    "My witchcraft utilizes a wide range of technologies, including (but not limited to):"
  ],
  "AboutMe.technologies": [
    "Angular",
    "RxJS",
    "HTML & (S)CSS",
    "JavaScript",
    "TypeScript",
    "graphQL",
    "Node.js",
    "YAML",
    "JSON",
    "NX",
    "CI / CD",
    "AWS"
  ],
  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "CareMonitor",
      "Title": "Member of Technical staff",
      "Date": "May 2020 - March 2025",
      "Description": [
        "👨‍🏫 Led the frontend department as team lead, scaling the UI Engineering team from 3 to 8 through strategic hiring, mentorship, and technical leadership.",
        "🧑‍💼 Played a key role in recruiting top technical talent, shaping a high-performing engineering culture aligned with the company’s growth from 5 to 40+ employees.",
        "🏥 Architected and launched mission-critical healthcare apps like Telehealth, e-Prescribing, and Scheduling in partnership with NSW government, enabling growth to 15K+ users.",
        "⚙️ Drove frontend excellence through Angular, RxJS, GraphQL, REST, and CI/CD, delivering consistent, scalable, and performant user experiences.",
        "♿ Spearheaded accessibility and UX initiatives, introducing standardized docs, developer checklists, and PR/release protocols for better quality and ISO compliance.",
        "🧠 Optimized remote engineering processes with structured task tracking, detailed release notes, and efficient collaboration practices, boosting productivity and delivery speed."
      ]
    },
    {
      "Tab": "Freelance",
      "Title": "Full Stack Developer",
      "Date": "Jan 2023 - feb 2023",
      "Description": [
        "🌐 Engineered a responsive PHP website for Jain Tours & Travels with Google Maps integration and sub-1-second load times using CDN-optimized images.",
        "📨 Integrated SMS API services for real-time communication and booking confirmations.",
        "🧩 Designed user-friendly forms to improve the inquiry and booking experience across devices.",
        "🚀 Deployed the full-stack application to Hostinger, handling hosting, configuration, and performance optimization."
      ]
    },
    {
      "Tab": "SalesTrendz",
      "Title": "UI Developer",
      "Date": "March 2019 - Jan 2020",
      "Description": [
        "🚀 Built scalable, maintainable Angular apps using a component-driven approach, services, and clean MVC architecture to ensure high-quality code.",
        "⚡ Optimized performance, delivering key UI improvements that reduced load times by 30% and significantly enhanced user experience.",
        "🤝 Collaborated across teams, actively contributing to cross-functional discussions and implementing robust Git workflows, including PR management and code reviews.",
        "🧠 Adapted quickly in a fast-paced startup, gaining broad exposure to real-world product challenges and agile development practices.",
        "🛠️ Integrated third-party APIs and tools like Google Maps and Sentry to enhance app functionality and monitor product reliability in production.",
        "🧩 Worked closely with designers, backend, and QA, ensuring seamless UI delivery with a strong focus on usability, performance, and polish."
      ]
    },
    {
      "Tab": "MIT Pune",
      "Title": "UI Developer",
      "Date": "Oct 2019 - dec 2019",
      "Description": [
        "🧑‍💻 Developed Technocon Lakshya, a digital registration platform for MIT Pune’s flagship event, streamlining the entire registration process.",
        "🔗 Integrated the platform with Townscript for seamless ticketing and participant management.",
        "🌐 Deployed the website on MIT’s official college server, enabling 100% digital registrations with reliable performance."
      ]
    },
    {
      "Tab": "Jabong.com",
      "Title": "Customer Service Executive",
      "Date": "May 2016 - Aug 2016",
      "Description": [
        "🤝 Built strong client relationships by delivering timely assistance, clear communication, and a personalized approach to enhance overall customer satisfaction.",
        "🎓 Educated customers on product features and best practices, empowering them with the knowledge needed to get the most value from the service.",
        "🛠️ Handled conflict resolution with empathy and professionalism, turning challenging situations into positive experiences through respectful and solution-focused communication."
      ]
    }
  ],
  "FeatureProjects.Title": "Recent Projects",
  "FeatureProjects.Label": "Highlighted Project",
  "FeatureProjects.Projects": [
    {
      "Title": "CM-UI",
      "Description": "Developed a comprehensive web application at CareMonitor for Patient Management, Remote Monitoring, and Virtual Care. Built using <span class='underline'>Angular</span> and <span class='underline'>Node.js</span>, with support for <span class='underline'>WebSockets</span>, <span class='underline'>multiple third-party integrations</span>, and infrastructure fully managed on <span class='underline'>AWS</span>.",
      "imgs": [
        "assets/images/projects/cm-ui/1.png",
        "assets/images/projects/cm-ui/2.png",
        "assets/images/projects/cm-ui/3.png",
        "assets/images/projects/cm-ui/4.png",
        "assets/images/projects/cm-ui/5.png"
      ],
      "Technologies": [
        "Angular",
        "PrimeNg",
        "Syncfusion",
        "RxJS",
        "Node.js",
        "AWS",
        "GraphQL"
      ]
    },
    {
      "Title": "CM-Careplan",
      "Description": "Developed a scalable and modular web application within an NX monorepo architecture for managing patient care plans. The application leverages <span class='underline'>Angular</span> for the frontend and <span class='underline'>Node.js</span> for the backend, featuring real-time updates via <span class='underline'>WebSockets</span>, seamless integration with multiple third-party services, and a robust infrastructure hosted on <span class='underline'>AWS</span>. Designed to streamline care plan creation, tracking, and collaboration among healthcare providers.",
      "imgs": [
        "assets/images/projects/cm-careplan/1.png",
        "assets/images/projects/cm-careplan/2.png"
      ],
      "Technologies": [
        "Angular",
        "PrimeNg",
        "RxJS",
        "Node.js",
        "AWS",
        "GraphQL"
      ]
    }
  ],
  "OtherProjects.Title": "More Projects",
  "OtherProjects.Projects": [
    {
      "Title": "Hands Game",
      "Description": "Extended rock-paper-scissors game. A personal project developed in Angular where you play randomly against the machine. It features the use of services, interfaces, and components.",
      "imgs": [
        "assets/images/hands-game.png"
      ],
      "ghLink": "https://github.com/andresjosehr/hands-game",
      "demoLink": "https://projects.andresjosehr.com/hands-game",
      "Technologies": [
        "Angular",
        "CSS GRID",
        "SASS",
        "Angular animations"
      ]
    },
    {
      "Title": "Countries Viewer",
      "Description": "Interface that consumes a countries API where you can view a list of countries, see details of each country, filter by name and region. It also has a dark mode to switch between dark and light themes.",
      "imgs": [
        "assets/images/countries-viewer.png"
      ],
      "ghLink": "https://github.com/andresjosehr/countries-viewer",
      "demoLink": "https://projects.andresjosehr.com/countries-viewer",
      "Technologies": [
        "Angular",
        "RxJS",
        "SASS",
        "API"
      ]
    }
  ],
  "Contact.Pretitle": "And... Now?",
  "Contact.Title": "Say Hi!",
  "Contact.Content": "Write to me, and lets build something great together.",
  "Contact.Btn": "Contact Me",
  "dxBall": {
    "title": "DX Ball",
    "startMessage": "Click to begin",
    "gameOver": "It was cool while it lasted! lets hire Chirag now.",
    "restartMessage": "Click to restart",
    "continueMessage": "Click to continue",
    "score": "Score: {{score}}",
    "lives": "Lives: {{lives}}",
    "instructions": {
      "title": "DX Ball Game made with",
      "link": "Prompt Engineering",
      "description": "Move your mouse or touch the screen and hold to control the paddle and break all the bricks!"
    },
    "restartButton": "Restart Game"
  }
}