{
  "Header.Item1": "Sobre Mí",
  "Header.Item2": "Experiencia",
  "Header.Item3": "Proyectos",
  "Header.Item4": "Contacto",
  "Header.cvBtn": "Currículum",
  "Header.cvName": "resume.pdf",
  "Banner.Pretitle": "¡Hola! Mi nombre es",
  "Banner.Description": "Con <span class='underline'>5 años de experiencia</span>, me especializo en crear sistemas frontend, componentes reutilizables y soluciones tecnológicas innovadoras para mejorar la accesibilidad web. Mi enfoque está en escribir código limpio, escalable y mantenible, principalmente en <span class='underline'>Angular</span> y en general en <span class='underline'>JavaScript</span>.",
  "Banner.ActionBtn": "Saludar",
  "AboutMe.Title": "Sobre Mí",
  "AboutMe.Paragraphs": [
    "Con más de <span class='underline'>5 años de experiencia profesional</span>, he desempeñado diversos roles como <span class='underline'>Desarrollador Frontend</span>, <span class='underline'>Tutor</span> y <span class='underline'>Líder Técnico</span>. Mi pasión radica en crear soluciones innovadoras que generen resultados impactantes.",
    "Me especializo en mejorar sistemas, optimizar el rendimiento, estandarizar patrones de desarrollo y proponer ideas que elevan el valor de cada proyecto al que contribuyo.",
    "Más allá del horario laboral, disfruto creando herramientas y aplicaciones para uso personal, combinando utilidad con creatividad.",
    "Mi arsenal tecnológico incluye una amplia gama de tecnologías, incluyendo (pero no limitado a):"
  ],
  "AboutMe.technologies": [
    "Angular",
    "RxJS",
    "HTML & (S)CSS",
    "JavaScript",
    "TypeScript",
    "graphQL",
    "Node.js",
    "YAML",
    "JSON",
    "NX",
    "CI / CD",
    "AWS"
  ],
  "Experience.Title": "Experiencia",
  "Experience.Jobs": [
    {
      "Tab": "CareMonitor",
      "Title": "Miembro del Personal Técnico",
      "Date": "Mayo 2020 - Marzo 2025",
      "Description": [
        "👨‍🏫 Lideré el departamento frontend como líder de equipo, escalando el equipo de Ingeniería UI de 3 a 8 miembros a través de contratación estratégica, mentoría y liderazgo técnico.",
        "🧑‍💼 Desempeñé un papel clave en la contratación de talento técnico de alto nivel, forjando una cultura de ingeniería de alto rendimiento alineada con el crecimiento de la empresa de 5 a más de 40 empleados.",
        "🏥 Diseñé y lancé aplicaciones críticas de salud como Telehealth, e-Prescribing y Scheduling en asociación con el gobierno de NSW, permitiendo el crecimiento a más de 15K usuarios.",
        "⚙️ Impulsé la excelencia frontend a través de Angular, RxJS, GraphQL, REST y CI/CD, entregando experiencias de usuario consistentes, escalables y de alto rendimiento.",
        "♿ Lideré iniciativas de accesibilidad y UX, introduciendo documentación estandarizada, listas de verificación para desarrolladores y protocolos de PR/release para mejor calidad y cumplimiento ISO.",
        "🧠 Optimicé procesos de ingeniería remota con seguimiento estructurado de tareas, notas de versión detalladas y prácticas de colaboración eficientes, impulsando la productividad y velocidad de entrega."
      ]
    },
    {
      "Tab": "Freelance",
      "Title": "Desarrollador Full Stack",
      "Date": "Ene 2023 - Feb 2023",
      "Description": [
        "🌐 Desarrollé un sitio web PHP responsivo para Jain Tours & Travels con integración de Google Maps y tiempos de carga inferiores a 1 segundo utilizando imágenes optimizadas con CDN.",
        "📨 Integré servicios de API SMS para comunicación en tiempo real y confirmaciones de reservas.",
        "🧩 Diseñé formularios fáciles de usar para mejorar la experiencia de consulta y reserva en todos los dispositivos.",
        "🚀 Implementé la aplicación full-stack en Hostinger, manejando alojamiento, configuración y optimización de rendimiento."
      ]
    },
    {
      "Tab": "SalesTrendz",
      "Title": "Desarrollador UI",
      "Date": "Marzo 2019 - Ene 2020",
      "Description": [
        "🚀 Construí aplicaciones Angular escalables y mantenibles usando un enfoque basado en componentes, servicios y arquitectura MVC limpia para asegurar código de alta calidad.",
        "⚡ Optimicé el rendimiento, entregando mejoras clave en la UI que redujeron los tiempos de carga en un 30% y mejoraron significativamente la experiencia de usuario.",
        "🤝 Colaboré entre equipos, contribuyendo activamente a discusiones multifuncionales e implementando flujos de trabajo Git robustos, incluyendo gestión de PR y revisiones de código.",
        "🧠 Me adapté rápidamente en una startup de ritmo acelerado, obteniendo amplia exposición a desafíos reales de productos y prácticas de desarrollo ágil.",
        "🛠️ Integré APIs y herramientas de terceros como Google Maps y Sentry para mejorar la funcionalidad de la aplicación y monitorear la confiabilidad del producto en producción.",
        "🧩 Trabajé estrechamente con diseñadores, backend y QA, asegurando una entrega fluida de UI con un fuerte enfoque en usabilidad, rendimiento y pulido."
      ]
    },
    {
      "Tab": "MIT Pune",
      "Title": "Desarrollador UI",
      "Date": "Oct 2019 - Dic 2019",
      "Description": [
        "🧑‍💻 Desarrollé Technocon Lakshya, una plataforma de registro digital para el evento principal de MIT Pune, optimizando todo el proceso de registro.",
        "🔗 Integré la plataforma con Townscript para una gestión fluida de boletos y participantes.",
        "🌐 Implementé el sitio web en el servidor oficial del colegio MIT, permitiendo registros 100% digitales con rendimiento confiable."
      ]
    },
    {
      "Tab": "Jabong.com",
      "Title": "Ejecutivo de Atención al Cliente",
      "Date": "Mayo 2016 - Ago 2016",
      "Description": [
        "🤝 Construí relaciones sólidas con los clientes brindando asistencia oportuna, comunicación clara y un enfoque personalizado para mejorar la satisfacción general del cliente.",
        "🎓 Educué a los clientes sobre características de productos y mejores prácticas, capacitándolos con el conocimiento necesario para obtener el máximo valor del servicio.",
        "🛠️ Manejé la resolución de conflictos con empatía y profesionalismo, convirtiendo situaciones desafiantes en experiencias positivas a través de una comunicación respetuosa y centrada en soluciones."
      ]
    }
  ],
  "FeatureProjects.Title": "Proyectos Recientes",
  "FeatureProjects.Label": "Proyecto Destacado",
  "FeatureProjects.Projects": [
    {
      "Title": "CM-UI",
      "Description": "Desarrollé una aplicación web integral en CareMonitor para Gestión de Pacientes, Monitoreo Remoto y Atención Virtual. Construida con <span class='underline'>Angular</span> y <span class='underline'>Node.js</span>, con soporte para <span class='underline'>WebSockets</span>, <span class='underline'>múltiples integraciones de terceros</span>, e infraestructura completamente gestionada en <span class='underline'>AWS</span>.",
      "imgs": [
        "assets/images/projects/cm-ui/1.png",
        "assets/images/projects/cm-ui/2.png",
        "assets/images/projects/cm-ui/3.png",
        "assets/images/projects/cm-ui/4.png",
        "assets/images/projects/cm-ui/5.png"
      ],
      "Technologies": [
        "Angular",
        "PrimeNg",
        "Syncfusion",
        "RxJS",
        "Node.js",
        "AWS",
        "GraphQL"
      ]
    },
    {
      "Title": "CM-Careplan",
      "Description": "Desarrollé una aplicación web escalable y modular dentro de una arquitectura monorepo NX para gestionar planes de atención de pacientes. La aplicación utiliza <span class='underline'>Angular</span> para el frontend y <span class='underline'>Node.js</span> para el backend, con actualizaciones en tiempo real a través de <span class='underline'>WebSockets</span>, integración perfecta con múltiples servicios de terceros, y una infraestructura robusta alojada en <span class='underline'>AWS</span>. Diseñada para simplificar la creación, seguimiento y colaboración de planes de atención entre proveedores de salud.",
      "imgs": [
        "assets/images/projects/cm-careplan/1.png",
        "assets/images/projects/cm-careplan/2.png"
      ],
      "Technologies": [
        "Angular",
        "PrimeNg",
        "RxJS",
        "Node.js",
        "AWS",
        "GraphQL"
      ]
    }
  ],
  "OtherProjects.Title": "Más Proyectos",
  "OtherProjects.Projects": [
    {
      "Title": "Hands Game",
      "Description": "Juego extendido de piedra-papel-tijera. Un proyecto personal desarrollado en Angular donde juegas aleatoriamente contra la máquina. Incluye el uso de servicios, interfaces y componentes.",
      "imgs": [
        "assets/images/hands-game.png"
      ],
      "ghLink": "https://github.com/andresjosehr/hands-game",
      "demoLink": "https://projects.andresjosehr.com/hands-game",
      "Technologies": [
        "Angular",
        "CSS GRID",
        "SASS",
        "Angular animations"
      ]
    },
    {
      "Title": "Countries Viewer",
      "Description": "Interfaz que consume una API de países donde puedes ver una lista de países, ver detalles de cada país, filtrar por nombre y región. También tiene un modo oscuro para cambiar entre temas oscuros y claros.",
      "imgs": [
        "assets/images/countries-viewer.png"
      ],
      "ghLink": "https://github.com/andresjosehr/countries-viewer",
      "demoLink": "https://projects.andresjosehr.com/countries-viewer",
      "Technologies": [
        "Angular",
        "RxJS",
        "SASS",
        "API"
      ]
    }
  ],
  "Contact.Pretitle": "Y... ¿Ahora?",
  "Contact.Title": "¡Saluda!",
  "Contact.Content": "Escríbeme, y construyamos algo grandioso juntos.",
  "Contact.Btn": "Contáctame",
  "dxBall": {
    "title": "DX Ball",
    "startMessage": "Click para comenzar",
    "gameOver": "¡Fue divertido mientras duró! Contratemos a Chirag ahora.",
    "restartMessage": "Click para reiniciar",
    "continueMessage": "Click para continuar",
    "score": "Puntuación: {{score}}",
    "lives": "Vidas: {{lives}}",
    "instructions": {
      "title": "Juego DX Ball hecho con",
      "link": "Ingeniería de Prompts",
      "description": "¡Mueve tu mouse o toca la pantalla y mantén para controlar la paleta y romper todos los ladrillos!"
    },
    "restartButton": "Reiniciar Juego"
  }
}
